<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px"> 

## Lab: SQL Practice

_Author: Matt Brems_

### Required Preparation

In order to run SQL queries within Python/this Jupyter notebook, you will need to install the following:

```bash
conda install sqlalchemy
conda install psycopg2
```

If you get an error trying to install `psycopg2`, you can install a stand-alone package (sufficient for everything you'll need to complete this lab) by entering the following anywhere in the terminal: 

```bash 
pip install psycopg2-binary
```

(If `pip` doesn't work for you, try `pip3 install psycopg2-binary`.)

### Instructions

In this lab, you're going to have ten prompts. Each prompt will require you to do two things:
1. Write a SQL query.
2. Use the result of that query to answer the question.

The purpose of this lab is to get you to practice your SQL - an **important** skill in data science! While it is possible to get these answers using Pandas, it should be your goal to do everything only in SQL.

**Data**: The data used in this lab is the Iowa liquor database. It contains various tables of transactions. The schema for this database is here:

<img src="./images/schema.png" alt="schema" width="750"/>

In [1]:
# Import Pandas and Create_Engine

import pandas as pd
from sqlalchemy import *
from sqlalchemy import create_engine

# Set up the engine to access the data.
engine = create_engine('postgresql://analytics_student:analyticsga@analyticsga-psql.generalassemb.ly:5432/iowa_liquor_sales_database')

In [2]:
engine.table_names()

<ipython-input-2-d72bc75a6b62>:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['counties', 'products', 'sales', 'stores']

In [3]:
# metadata so we can view column and type information

meta = MetaData();
meta.reflect(bind=engine);

<ipython-input-3-f3d516a66d39>:4: SAWarning: Skipped unsupported reflection of expression-based index products_proof_as_integer
  meta.reflect(bind=engine);
<ipython-input-3-f3d516a66d39>:4: SAWarning: Skipped unsupported reflection of expression-based index products_vendor_number_as_text
  meta.reflect(bind=engine);
<ipython-input-3-f3d516a66d39>:4: SAWarning: Skipped unsupported reflection of expression-based index sales_vendor_no_as_integer
  meta.reflect(bind=engine);

In [4]:
print(meta.tables.keys())

dict_keys(['counties', 'products', 'sales', 'stores'])

### Prompt 1

How many rows are there in the `stores` table of the Iowa liquor database?

**Prompt 1 Answer**:

In [5]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT COUNT(*) 
FROM stores
"""

pd.read_sql_query(sql, engine)

   count
0   1973

### Prompt 2

If you sort the stores in alphabetical order by name, which store is fourth?

**Prompt 2 Answer**:

In [6]:
sql = """
WITH stores AS (
    SELECT (ROW_NUMBER() OVER (ORDER BY stores.name ASC)) as row,*
    FROM stores)
SELECT * FROM stores WHERE row = 4
"""

pd.read_sql_query(sql, engine)

,row,store,name,store_status,store_address,address_info
0,4,3061,3061 Cub Foods / Sioux City,I,"1732 Hamilton Blvd\nSioux City, IA 511030000\n...",None

In [7]:
sql = """
SELECT
    *
FROM
    stores
ORDER BY
    stores.name
LIMIT 1 OFFSET 3;
"""

pd.read_sql_query(sql, engine)

,store,name,store_status,store_address,address_info
0,3061,3061 Cub Foods / Sioux City,I,"1732 Hamilton Blvd\nSioux City, IA 511030000\n...",None

### Prompt 3

Among those sales whose category name is `IMPORTED VODKA`, if you sort by vendor in alphabetical order, what is the bottle price and number of bottles bought in the first 3 transactions?
> You should give us three sets of numbers - one for each transaction.

In [8]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT 
    COLUMN_NAME 
FROM 
    INFORMATION_SCHEMA.COLUMNS
WHERE 
    TABLE_NAME  = 'sales'
"""

pd.read_sql_query(sql, engine)

          column_name
0                date
1   convenience_store
2               store
3       county_number
4              county
5            category
6       category_name
7           vendor_no
8              vendor
9                item
10        description
11               pack
12         liter_size
13     state_btl_cost
14          btl_price
15         bottle_qty
16              total

**Prompt 3 Answer**:

In [9]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT 
    s.category_name, s.vendor, s.btl_price, s.bottle_qty
FROM 
    sales AS s
WHERE 
    s.category_name in ('IMPORTED VODKA')
    ORDER BY s.vendor ASC
LIMIT 3 OFFSET 0;
"""

pd.read_sql_query(sql, engine)

    category_name                     vendor btl_price  bottle_qty
0  IMPORTED VODKA  Adamba Imports Int'l Inc.     $8.99          12
1  IMPORTED VODKA      A Hardy / U.S.A. Ltd.    $28.50           3
2  IMPORTED VODKA      A Hardy / U.S.A. Ltd.    $28.50           6

### Prompt 4

What is the total amount of liquor sold in February 2015?

In [10]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT SUM(s.bottle_qty) AS total_bottles_feb 
FROM sales AS s
WHERE s.date < '2015-02-28' AND s.date > '2015-02-01'



"""

pd.read_sql_query(sql, engine)

   total_bottles_feb
0            1591962

**Prompt 4 Answer**:

### Prompt 5

Among all transactions where `IMPORTED VODKA` was sold, which vendor has the most transactions? Report the total number of transactions, the number of bottles sold, and the total amount of revenue from these transactions. Rename the columns to make sure there isn't any confusion as to what they mean!

In [11]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT vendor, bottle_qty, total, count(*) AS transaction_count

FROM sales AS s
WHERE s.category_name in('IMPORTED VODKA')
GROUP BY vendor, bottle_qty, total
ORDER BY transaction_count DESC
LIMIT 3
OFFSET 0

"""

pd.read_sql_query(sql, engine)

                             vendor  bottle_qty   total  transaction_count
0  Pernod Ricard USA/Austin Nichols          12  206.88               6576
1  Pernod Ricard USA/Austin Nichols          12  269.88               3668
2               Bacardi U.S.A. Inc.          12  332.88               3623

**Prompt 5 Answer**:

### Prompt 6

The reason we sell things is to make money. In sales, the term **markup** means the amount of extra money charged for a product over the cost to make that product. (You can think of the markup as the profit for that product.)

In Iowa, the law states the minimum price at which liquor may be sold.

Calculate the markup (name this `Markup`) that shows the difference between the `btl_price` and the `state_btl_cost`. 

> If you haven't subtracted columns together before, [this StackOverflow question](https://stackoverflow.com/questions/7536996/multiplying-two-columns-in-sql-server/7537059) may be helpful.

In [12]:
# Use a SQL query to find the answer to the above prompt.

sql = """
Select btl_price - state_btl_cost as markup FROM sales

"""

pd.read_sql_query(sql, engine)

         markup
0         $5.75
1         $5.75
2         $5.75
3         $8.58
4         $2.50
...         ...
3049908   $5.75
3049909  $10.00
3049910   $5.75
3049911   $5.75
3049912  $10.00

[3049913 rows x 1 columns]

### Prompt 7

Calculate the "Percentage Markup" by dividing markup by the state bottle cost. (Rather than the total profit per bottle, this will tell you how much stores are increasing their price over the state minimum.)

After calculating the "Percentage Markup," calculate the average percentage markup per **store**. Which store has the largest average markup, and what is that average markup?

In [13]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT  stores.name, (sales.btl_price - sales.state_btl_cost)/sales.state_btl_cost*100 AS percentage_markup
FROM stores

INNER JOIN sales ON stores.store=sales.store

ORDER BY percentage_markup DESC
LIMIT 10

"""

pd.read_sql_query(sql, engine)

                                   name  percentage_markup
0    Hy-Vee Wine and Spirits / Waterloo         853.865979
1                       Hy-vee #4 / Wdm         853.865979
2     Hy-Vee Food Store #1 / Mason City         853.865979
3                       Hy-Vee / Waukee         853.865979
4  Hy-vee Wine and Spirits / Washington         853.865979
5                       Hy-Vee / Waukee         853.865979
6                       Hy-vee #4 / Wdm         853.865979
7    Hy-Vee Wine and Spirits / Waterloo         853.865979
8   Hy-Vee Drugstore / University / DSM         853.865979
9   Hy-Vee Drugstore / University / DSM         853.865979

In [28]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT  sales.store, AVG((sales.btl_price::numeric - sales.state_btl_cost::numeric)/sales.state_btl_cost::numeric)*100 AS avg_percentage_markup
FROM sales
GROUP BY sales.store

ORDER BY avg_percentage_markup DESC
LIMIT 10

"""

pd.read_sql_query(sql, engine)

   store  avg_percentage_markup
0   4013              52.547124
1   4024              52.149880
2   4266              51.890342
3   3833              51.509378
4   3660              51.459084
5   3628              51.443853
6   3889              51.412550
7   3934              51.409767
8   3749              51.374724
9   3696              51.328566

**Prompt 7 Answer**:

### Prompt 8

Building off of your last query, retrieve the five stores with the highest average markup percentage. Along with the store IDs and average markup percentage, please return the minimum and maximum markup percentage for those stores, as well as the names and addresses of those store.

What are the names of the five stores?

In [34]:
# Use a SQL query to find the answer to the above prompt.

sql = """

SELECT  stores.store, stores.name, stores.store_address, MIN((sales.btl_price::numeric - sales.state_btl_cost::numeric)/sales.state_btl_cost::numeric)*100 AS min, MAX((sales.btl_price::numeric - sales.state_btl_cost::numeric)/sales.state_btl_cost::numeric)*100 AS max ,AVG((sales.btl_price::numeric - sales.state_btl_cost::numeric)/sales.state_btl_cost::numeric)*100 AS avg_percentage_markup
FROM sales
INNER JOIN stores ON stores.store=sales.store
GROUP BY stores.store

ORDER BY avg_percentage_markup DESC
LIMIT 10
"""

pd.read_sql_query(sql, engine)

,store,name,store_address,min,max,avg_percentage_markup
0,4013,Wal-Mart 0841 / Tipton,"1126 Highway 38 North\nTipton, IA 527720000\n(...",49.857143,670.876289,52.547124
1,4024,Wal-Mart 1546 / Iowa Falls,"840 S Oak\nIowa Falls, IA 501260000\n(42.50295...",49.846154,670.876289,52.149880
2,4266,Wal-Mart 1683 / Shenandoah,"705 S Fremont\nShenandoah, IA 516010000\n(40.7...",49.846154,670.876289,51.890342
3,3833,Wal-Mart 3394 / Atlantic,"1905 East 7th St\nAtlantic, IA 500220000\n(41....",49.846154,670.876289,51.509378
4,3660,Wal-Mart 2935 / Knoxville,"814 W Bell Ave\nKnoxville, IA 501380000\n(41.3...",49.846154,670.876289,51.459084
5,3628,Wal-Mart 1528 / Cedar Rapids,"2645 Blairs Ferry Rd Ne\nCedar Rapids, IA 5240...",49.846154,670.876289,51.443853
6,3889,Wal-Mart 1005 / Waverly,"700 29 St Sw\nWaverly, IA 506770000\n(42.70029...",49.846154,670.876289,51.412550
7,3934,Wal-Mart 1509 / Maquoketa,"103 E Carlisle\nMaquoketa, IA 520600000\n(42.0...",49.846154,670.876289,51.409767
8,3749,Wal-Mart 1526 / Storm Lake,"1831 Lake Ave Nw\nStorm Lake, IA 505880000\n(4...",49.846154,670.876289,51.374724
9,3696,Wal-Mart 1723 / Des Moines,"5101 Se 14th St\nDes Moines, IA 503150000\n(41...",49.833333,670.876289,51.328566

**Prompt 8 Answer**:

### Prompt 9

Which nine counties sell the highest number of bottles of liquor per capita (per person)? Calculate the average bottle size of the bottles of liquor sold by these counties rounded to the nearest first decimal place. Of the nine counties selling the highest number of bottles of liquor per capita, which county sells (on average) the largest bottle size?

**_BONUS FUN_**: This question can (also) be solved with a SQL subquery - that is, a query that queries a query! If you'd like to give this a try, you can read more about it [here](https://www.dofactory.com/sql/subquery). Otherwise, keep an eye out for the solution key!

In [94]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT  c.county, SUM(sales.bottle_qty) /(c.population) as liquor_per_capita, AVG(p.bottle_size) AS avg_bottle_size
FROM counties AS c

INNER JOIN sales ON sales.county=c.county
INNER JOIN products AS p ON p.item_no=sales.item
GROUP BY  c.county
ORDER BY liquor_per_capita DESC
LIMIT 9
"""

pd.read_sql_query(sql, engine)

          county  liquor_per_capita  avg_bottle_size
0      Dickinson                 22       974.148890
1           Polk                 15       892.588027
2     Black Hawk                 15       862.902896
3    Cerro Gordo                 14       986.427392
4          Scott                 13       871.626636
5        Johnson                 13       895.373151
6           Linn                 12       886.254321
7  Pottawattamie                 11       893.713467
8        Kossuth                 11      1041.042443

**Prompt 9 Answer**:

### Prompt 10 (advanced but required!)

In the `sales` table, three columns are `btl_price`, `bottle_qty`, and `total`. The `total` for a transaction _should be_ the product of `btl_price` and `bottle_qty`. How many transactions have a value of `total` that is not equal to `btl_price` time `bottle_qty`?

> There will be a type error as well! We cannot compare type `money` to type `real`. We have to convert `total` to type `money` so that we can compare the two directly. [This link](https://docs.microsoft.com/en-us/sql/t-sql/functions/cast-and-convert-transact-sql?view=sql-server-ver15#syntax) may be helpful to you!

In [100]:
# Use a SQL query to find the answer to the above prompt.

sql = """

SELECT s.bottle_qty*s.btl_price AS true_total, ((s.bottle_qty*s.btl_price)::numeric-total::numeric) AS total_difference
FROM sales AS s


"""

pd.read_sql_query(sql, engine)

        true_total  total_difference
0           $68.96               0.0
1          $206.88               0.0
2          $206.88               0.0
3          $154.38               0.0
4           $45.00               0.0
...            ...               ...
3049908    $206.88               0.0
3049909    $899.70               0.0
3049910    $206.88               0.0
3049911    $206.88               0.0
3049912    $359.88               0.0

[3049913 rows x 2 columns]

In [105]:
# Use a SQL query to find the answer to the above prompt.

sql = """

SELECT COUNT((s.bottle_qty*s.btl_price)::numeric != ((s.bottle_qty*s.btl_price)::numeric-total::numeric)) AS not_equal
FROM sales AS s


"""

pd.read_sql_query(sql, engine)

   not_equal
0    3049913

**Prompt 10 Answer**: